3B/CS486/07-Supervised-Machine-Learning-Foundations.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-18 Fri 17:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Supervised Machine Learning: Foundations</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Supervised Machine Learning: Foundations</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org59d5761">1. Learning</a>
<ul>
<li><a href="#org23ee1a1">1.1. P/N Agents</a>
<ul>
<li><a href="#org6fb4a0c">1.1.1. Bias</a></li>
</ul>
</li>
<li><a href="#org0b57784">1.2. Learning as Search</a></li>
</ul>
</li>
<li><a href="#orgd776410">2. Supervised Learning</a>
<ul>
<li><a href="#org10513a6">2.1. Noise</a></li>
</ul>
</li>
<li><a href="#org0c31517">3. Measures of Error</a>
<ul>
<li><a href="#org4cd48af">3.1. Precision and Recall</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org59d5761" class="outline-2">
<h2 id="org59d5761"><span class="section-number-2">1.</span> Learning</h2>
<div class="outline-text-2" id="text-1">
<p>
The ability to improve behaviour based on experience.
Improvements can be:
</p>
<ul class="org-ul">
<li><b>range</b> of behaviours is expanded: agent can do more</li>
<li><b>accuracy</b> on tasks is improved: agent can do things better</li>
<li><b>speed</b> is improved: agent can do things faster</li>
</ul>

<p>
Components of a learning problem:
</p>
<ul class="org-ul">
<li><b>task</b>: behaviour being improved</li>
<li><b>data</b>: experiences used to improve performance in the task</li>
<li><b>measure of improvement</b></li>
</ul>

<p>
Common learning tasks include:
</p>
<ul class="org-ul">
<li><b>supervised classification</b>: given a set of pre-classified data, classify a new instance</li>
<li><b>unsupervised learning</b>: find natural classes for examples</li>
<li><b>reinforcement learning</b>: determine what to do based on rewards and punishments</li>
<li><b>transfer learning</b>: learn from an expert</li>
<li><b>active learning</b>: learner actively seeks to learn</li>
<li><b>inductive logic programming</b>: build richer models in terms of logic programs</li>
</ul>

<p>
Learning tasks can be characterized by the feedback given to the learner:
</p>
<ul class="org-ul">
<li>for supervised learning, what has to be learned is specified per example</li>
<li>for unsupervised learning, no classifications given so learner must discover categories and regularities
in data</li>
<li>for reinforcement learning, feedback occurs after a sequence of actions</li>
</ul>
</div>
<div id="outline-container-org23ee1a1" class="outline-3">
<h3 id="org23ee1a1"><span class="section-number-3">1.1.</span> P/N Agents</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Measure of success is how well the agent performs on new, unseen examples.
</p>

<p>
For two agents solving a binary classification task:
</p>
<ul class="org-ul">
<li>\(P\) claims the negative examples seen are the only negative examples (all others positive)</li>
<li>\(N\) claims the positive examples seen are the only positive examples (all others negative)</li>
</ul>

<p>
Both agents correctly classify every training example, but disagree on every other example.
They use training data as their model, needing an exact match.
</p>
</div>
<div id="outline-container-org6fb4a0c" class="outline-4">
<h4 id="org6fb4a0c"><span class="section-number-4">1.1.1.</span> Bias</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Tendency to prefer one hypothesis over another.
Necessary to make predictions on unseen data.
</p>

<p>
To make predictions on unseen data, bias is necessary.
Good biases must be tested to find out their quality.
</p>
</div>
</div>
</div>
<div id="outline-container-org0b57784" class="outline-3">
<h3 id="org0b57784"><span class="section-number-3">1.2.</span> Learning as Search</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Given a representation and bias, learning is search through all possible representations looking
for the representation(s) that best fit the data, given the bias.
</p>

<p>
Learning algorithm is made of:
</p>
<ul class="org-ul">
<li>search space (possible representations)</li>
<li>evaluation function</li>
<li>search method</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd776410" class="outline-2">
<h2 id="orgd776410"><span class="section-number-2">2.</span> Supervised Learning</h2>
<div class="outline-text-2" id="text-2">
<p>
Supervised learning requires:
</p>
<ul class="org-ul">
<li>a set of input features \(X_{1}, \dots, X_{n}\)</li>
<li>a set of target features \(Y_{1}, \dots, Y_{k}\)</li>
<li>a set of training examples with values given for input features and target features</li>
<li>a set of test examples where only values for input features are given</li>
</ul>

<p>
<span class="underline">Goal</span>: Predict values of target features for test examples using
</p>
<ul class="org-ul">
<li>classification when target features are discrete</li>
<li>regression when target features are continuous</li>
</ul>
</div>
<div id="outline-container-org10513a6" class="outline-3">
<h3 id="org10513a6"><span class="section-number-3">2.1.</span> Noise</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Data can have:
</p>
<ul class="org-ul">
<li>some features assigned the wrong value</li>
<li>inadequate features to predict classification</li>
<li>missing features</li>
</ul>

<p>
<b>Overfitting</b>: distinction appears in training data but not in test data, due to random correlations
</p>
</div>
</div>
</div>
<div id="outline-container-org0c31517" class="outline-2">
<h2 id="org0c31517"><span class="section-number-2">3.</span> Measures of Error</h2>
<div class="outline-text-2" id="text-3">
<p>
For a feature \(Y\) and example \(e\):
</p>
<ul class="org-ul">
<li>\(Y(e)\) is the value of feature \(Y\) for \(e\)</li>
<li>\(\hat{Y}(e)\) is the predicted value of feature \(Y\) for \(e\)</li>
<li><b>error</b> of prediction: measure of how how close \(Y(e)\) and \(\hat{Y}(e)\) are</li>
</ul>

<p>
Let \(E\) be a set of examples and \(T\) be a set of target features:
</p>
<ul class="org-ul">
<li><b>absolute error</b>
\[
  \sum_{e \in E} \sum_{Y \in T} \left| Y(e) - \hat{Y}(e) \right|
  \]</li>
<li><b>sum of squares error</b>
\[
  \sum_{e \in E} \sum_{Y \in T} \left( Y(e) - \hat{Y}(e) \right)^{2}
  \]</li>
<li><b>worst case error</b>
\[
  \max_{e \in E} \max_{Y \in T} \left| Y(e) - \hat{Y}(e) \right|
  \]</li>
<li><b>cost-based error</b>: takes into account costs of various errors</li>
</ul>

<p>
For the case where target features are \(Y(e) \in \{0, 1\}\) and predicted features are
\(\hat{Y}(e) \in [0, 1]\):
</p>
<ul class="org-ul">
<li><b>likelihood of the data</b>:
\[
  \prod_{e \in E} \prod_{Y \in T} P(\hat{Y}(e) \mid Y(e))
  \]
\[
  \prod_{e \in E} \prod_{Y \in  T} \hat{Y}(e)^{Y(e)} (1 - \hat{Y}(e))^{(1 - Y(e))}
  \]</li>
<li><b>entropy</b> or <b>negative log likelihood</b>
\[
  -\sum_{e \in E} \sum_{Y \in T} \left[ Y(e) \log( \hat{Y}(e) ) + (1 - Y(e)) \log ( 1 - \hat{Y}(e) ) \right]
  \]</li>
</ul>
</div>
<div id="outline-container-org4cd48af" class="outline-3">
<h3 id="org4cd48af"><span class="section-number-3">3.1.</span> Precision and Recall</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>Recall</b> or <b>sensitivity</b>
\[
\frac{\text{true positives}}{\text{true positives} + \text{false negatives}}
\]
</p>

<p>
<b>Specificity</b>
\[
\frac{\text{true negatives}}{\text{true negatives} + \text{false positives}}
\]
</p>

<p>
<b>Precision</b>
\[
\frac{\text{true positives}}{\text{true positives} + \text{false positives}}
\]
</p>

<p>
<b>F1-measure</b>
\[
\frac{2 \times \text{Precision} \times \text{Recall}}{\text{Precision} + \text{Recall}}
\]
</p>

<p>
The <b>receiver operating curve</b> gives the full range of performance of an algorithm across different
biases.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-10-18 Fri 17:38</p>
</div>
</body>
</html>
